function [] = main2(A)

% =============== Точное решение ===============

y_exact_f = @(x) [0.0040781 * e ^ (-247.104 * x) + 0.995922 * e ^ (-0.895938 * x);
                  1.00405 * e ^ (-0.895938 * x) - 0.00404511 * e ^ (-247.104 * x)];

y_exact = zeros(500, 2);
for i = 1:500
    y_exact(i, :) = y_exact_f(0.001 * i);
end

% =============== Метод Эйлера ===============

h = 0.001;
y_euler = euler([1; 1], h, A);

disp('Решение методом Эйлера в тех же точках, h=0.001 (погрешности): ')
main2disp(y_euler, y_exact)
disp('')
fprintf('lambda(W) = %f\n', 1 + h*eig(A))
disp('')
disp('=============================================')
disp('')

% =============== Обратный метод Эйлера ===============

h = 0.001;
y_euler_rev = eulerrev([1; 1], h, A);

disp('Решение обратным методом Эйлера в тех же точках (погрешности): ')
main2disp(y_euler_rev, y_exact)
disp('')
fprintf('lambda(W) = %f\n', 1/(1 - h*eig(A)))
disp('')
disp('=============================================')
disp('')
 
% =============== Интерполяционный метод Адамса III порядка ===============

h = 0.001;
y_adams = adams(y_exact, h, A);

disp('Решение интерполяционным методом Адамса III порядка (погрешности): ')
main2disp(y_adams, y_exact)
disp('')
disp('=============================================')
disp('')

end
